app/controllers/api/v1/impressions_controller.rb

			def index
				@impressions = Impression.all
---
SELECT `impressions`.* FROM `impressions`