app/controllers/api/v1/pictures_controller.rb

SELECT `pictures`.* FROM `pictures`
---
			def index
				@pictures = Picture.all

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1
---
			def set_picture
				@picture = Picture.find(params[:id])